"""
Да се реализира на python програма за създаване на хистограма на честотата на срещане на
символите в даден текст. Програмата да приема като входен параметър текст
и да извежда в конзолата съдържанието на речник, съдържащ ключове - символите от текста, 
а стойностите  - броя срещания на съответния символ. 
Името на изпълнимия файл да е в следния формат: XXXXX_L4_T2.py,

където XXXXX е вашето потребителско име в пощата, с която сте регистрирани.

Ако например вашият адрес е ivan_petrov@gmail.com, файлът трябва да се казва  ivan_petrov_L4_T2.py

Предавайте САМО изходния код, без архиви, двоични файлове, виртуални среди и други!


Примерен изход:

[('a', 5), ('b', 1), ('c', 1), ('i', 1), ('l', 2), ('n', 1)]
"""

import sys

def hist(txt):
    d = {}
    for c in txt:
        if c in d:
            d[c] += 1
        else:
            d[c] = 1
    return d

print(hist(sys.argv[1]))