"""
Напишете програма, която извежда списък от всички ключове, 
които сочат към дадена стойност, а ако няма нито една такава стойност, 
то да се връща празен списък. Програмата да приема като входен параметър
стойността за търсене. 
Речникът да е статично описан в кода на програмата и да е следния: 
d={1:'a',2:'b',3:'c',4:'a',5:'d',6:'e',7:'a',8:'b'} 
Името на изпълнимия файл да е в следния формат: XXXXX_L4_T1.py,

където XXXXX е вашето потребителско име в пощата, с която сте регистрирани.

Ако например вашият адрес е ivan_petrov@gmail.com, файлът трябва да се казва  ivan_petrov_L4_T1.py

Предавайте САМО изходния код, без архиви, двоични файлове, виртуални среди и други!


Примерен изход:

[1, 4, 7]

"""

import sys 

def find_keys(c):
    res = []
    d={1:'a',2:'b',3:'c',4:'a',5:'d',6:'e',7:'a',8:'b'}
    for key, val in d.items():
        if val == c:
            res.append(key)
    return res

print(find_keys(sys.argv[1]))