"""
Напишете рекурсивна функция за двоично търсене в нареден списък. 
Програмата с име XXXXX_L5_T3.py, където XXXXX е вашето потребителско име в пощата, 
с която сте регистрирани, да получава параметър от командния ред 
(със sys.argv, не от клавиатурата) число за търсене. 

Резултатът е един от следните два:
not found - ако стойността не се намира в списъка
found at X - ако първото срещане на търсената стойност в списъка е на позиция X

Списъкът за търсене да е статично описан в кода и да е следният:
[30, 40, 50, 52, 56, 62, 70, 91, 100, 131, 132, 166, 170, 195, 202, 205, 
212, 248, 249, 256, 263, 272, 288, 289, 290, 296, 332, 345, 352, 364, 380, 
390, 407, 412, 429, 430, 438, 444, 486, 493, 497, 499, 510, 513, 514, 519, 
521, 521, 535, 546, 552, 554, 556, 570, 584, 638, 640, 655, 655, 657, 692, 
692, 711, 713, 731, 739, 740, 842, 858, 885, 887, 888, 893, 898, 900, 903, 
908, 909, 959, 988]

Примерен изход при подаване на параметър 88999999

not found

Примерен изход при подаване на параметър 584

found at 54
"""

import sys

def binary_search(n, left, right, lst):
    central_index = (right + left) // 2
    
    if left > right or central_index > len(lst) - 1:
        return 'not found'
   
    if lst[central_index] == n:
            if central_index == 0 or lst[central_index - 1] != n:
                return f'found at {central_index}'
            else:
                return binary_search(n, left, central_index - 1, lst)
    elif lst[central_index] > n:
        return binary_search(n, left, central_index - 1, lst)
    else:
        return binary_search(n, central_index + 1, right, lst)
 
lst = [30, 40, 50, 52, 56, 62, 70, 91, 100, 131, 132, 166, 170, 195, 202, 
        205, 212, 248, 249, 256, 263, 272, 288, 289, 290, 296, 332, 345, 
        352, 364, 380, 390, 407, 412, 429, 430, 438, 444, 486, 493, 497, 499, 
        510, 513, 514, 519, 521, 521, 535, 546, 552, 554, 556, 570, 584, 638, 
        640, 655, 655, 657, 692, 692, 711, 713, 731, 739, 740, 842, 858, 885, 887, 
        888, 893, 898, 900, 903, 908, 909, 959, 988]
    
print(binary_search(int(sys.argv[1]), 0, len(lst), lst))